#line 1 "C:\\WORK\\学校\\未来創造展\\ms_project\\ms_project\\common.h"
/* -------------------------------------------------------------------------- */
/* common.h																 																    */
/* シ  ス  テ  ム  メ  イ  ン												 												  */
/* アプリケーションエントリーポイントです。(Arduinoではここが								  */
/*																					エントリポジションです。)					*/
/* -------------------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */
/* 番号		更新履歴								日付　氏名																  */
/* -------------------------------------------------------------------------- */
/* 000000	新規作成								2023/12/04　山田龍之介		 								  */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/* typedef宣言																                                */
/* -------------------------------------------------------------------------- */
typedef char           SCHR;					/* signed   char型			  */
typedef unsigned char  UCHR;					/* unsigned char型			  */
typedef short          SSHT;					/* signed   short型			  */
typedef unsigned short USHT;					/* unsigned short型			  */
typedef long           SLNG;					/* signed   long型			  */
typedef unsigned long  ULNG;					/* unsigned long型			  */
typedef int            SINT;					/* signed   int型			    */
typedef unsigned int   UINT;					/* unsigned int型			    */

/* -------------------------------------------------------------------------- */
/* define宣言																                                  */
/* -------------------------------------------------------------------------- */
#define OK              (    0 )				/* 正常終了					  */
#define NG              (   -1 )				/* 失敗						    */
#define PARAM           (   -2 )				/* 引数エラー				  */



/* -------------------------------------------------------------------------- */
/* 				Copyright HAL College of Technology & Design				                */
/* -------------------------------------------------------------------------- */