#line 1 "C:\\WORK\\学校\\未来創造展\\ms_project\\ms_project\\servo.h"
/* -------------------------------------------------------------------------- */
/* servo.h																  */
/* ＣＬ２３・ＳＤ３２・ＲＤ４Ｃ												  */
/* サーボ制御に係るヘッダ															  */
/* -------------------------------------------------------------------------- */
/* 番号		更新履歴								日付		氏名		  */
/* -------------------------------------------------------------------------- */
/* 000000	新規作成								2013/05/08	桝井　隆治	  */
/* 000001   機能追加                                2023/12/06  筈尾　辰也       */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/* includeファイル															  */
/* -------------------------------------------------------------------------- */
#include "common.h"							    /* システム共通ヘッダ		  */

/* -------------------------------------------------------------------------- */
/* define宣言																  */
/* -------------------------------------------------------------------------- */
#define SERVO_MAX          (   18 )			/* サーボ個数				  */
#define SERVO_OK           (    0 )			/* 成功						  */
#define SERVO_NG           (   -1 )			/* 失敗						  */
#define SERVO_PARAM        (   -2 )			/* 引数エラー				  */
#define SERVO_READY        (    0 )			/* サーボ待機				  */
#define SERVO_BUSY         (    3 )			/* サーボビジー				  */
#define SERVO_NOSET      ( 0xEFFF )			/* サーボ設定無し			  */

#define SERVO_ANG_MIN          0            /* サーボモータの最大距離      */
#define SERVO_ANG_MAX        180            /* サーボモータの最小角距離     */
#define SERVO_SP_ANG_MAX     270            /* サーボモータの最小角距離     */

/* ##1度の移動時間は目検で調べるしかない */
#define SERVO_MOVETIME     (   7 )			/* サーボ１度移動に必要な時間(ms) */

/* -------------------------------------------------------------------------- */
/* プロトタイプ宣言															  */
/* -------------------------------------------------------------------------- */
void msServoInit(void);
SLNG msServoGetBusy(UCHR* busyflags, USHT max);
SLNG msServoSet(SLNG* returns, uint16_t* angles, USHT max);
void msServoTimerCallback(void* id);

/* -------------------------------------------------------------------------- */
/* 構造体定義																  */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/* 				Copyright HAL College of Technology & Design				  */
/* -------------------------------------------------------------------------- */